{
  "navbar": {
    "fullname": "ภาสกร สุวรรณโท",
    "home": "หน้าแรก",
    "about": "เกี่ยวกับ",
    "skill": "ทักษะ",
    "project": "ผลงาน",
    "experience": "ประสบการณ์",
    "contact": "ติดต่อ"
  },
  "home": {
    "title": "สวัสดีครับ ผมชื่อ เบสท์",
    "subtitle": "นักพัฒนาเว็บฝั่งหน้าบ้าน | คนหลงใหลในการเขียนโค้ด",
    "description1": "ผมรักการสร้างเว็บไซต์ที่เร็ว สวย และใช้งานง่าย ด้วยประสบการณ์ใน Framework ที่ใช้ และ UX ที่ดี",
    "description2": "กำลังพัฒนาทักษะอย่างต่อเนื่องเพื่อก้าวไปสู่การเป็น Full Stack Developer ในอนาคต",
    "dowloadResume": "ดาวน์โหลดประวัติย่อ"
  },
   "about": {
    "title": "เกี่ยวกับฉัน",
    "subtitle": "ฉันเป็นนักพัฒนาเว็บไซต์ฝั่งผู้ใช้ (Frontend Developer)",
    "description1": "สวัสดีครับ ผมเป็น Frontend Dev ที่ชื่นชอบการสร้าง UI ที่ทั้งสวยงามและใช้งานได้จริง มีความหลงใหลในการใช้เทคโนโลยีสมัยใหม่เช่น React, Next.js, TailwindCSS และ TypeScript เพื่อสร้างเว็บไซต์ที่ทันสมัยและประสิทธิภาพสูง",
    "description2": "ผมเชื่อในงานออกแบบที่ใส่ใจในรายละเอียด การเขียนโค้ดที่สะอาด และการเรียนรู้ที่ไม่หยุดนิ่ง",
    "tool": "เทคโนโลยีและเครื่องมือที่ใช้"
  },
  "skill": {
    "title": "ทักษะและเครื่องมือ",
    "section1": "งานพัฒนาฝั่งผู้ใช้ / ฝั่งหน้าเว็บไซต์",
    "section2": "ฝั่งเซิร์ฟเวอร์ (กำลังเรียนรู้)",
    "section3": "การจัดรูปแบบ / การตกแต่งหน้าเว็บ",
    "section4": "เครื่องมือ"
  },
  "contact": {
    "title": "ช่องทางการติดต่อ",
    "subtitle": "ถ้าคุณสนใจร่วมงาน หรืออยากคุยเรื่องโปรเจกต์ สามารถติดต่อผมได้ตามช่องทางด้านล่างนี้ครับ",
    "dowloadResume": "ดาวน์โหลดประวัติย่อ"
  },
  "experience": {
    "title": "ประสบการณ์",
    "section1": {
      "company": "Full-time / Freelance",
      "title": "นักพัฒนาเว็บฝั่งหน้าบ้าน",
      "subtitle": "2022 – ปัจจุบัน",
      "description": "พัฒนาเว็บไซต์แบบ Responsive โดยใช้ React, Next, Vue, Nuxt, Angular และ Tailwindร่วมทำงานกับลูกค้าในด้าน UI/UX และนำเว็บไซต์ขึ้นระบบด้วย Vercel"
    },
    "section2": {
      "company": "โปรเจกต์ส่วนตัว",
      "title": "นักพัฒนาเว็บฝั่งหลังบ้าน (กำลังศึกษา)",
      "subtitle": "2023 – ปัจจุบัน",
      "description": "สร้างโปรเจกต์ Fullstack โดยใช้ Node.js, .NET, Golang และ MySQLเน้นการพัฒนา REST APIs และระบบ Authentication"
    },
    "section3": {
      "company": "มหาวิทยาลัย",
      "title": "นักศึกษา IT",
      "subtitle": "2020 – ปัจจุบัน",
      "description": "กำลังศึกษาเกี่ยวกับการพัฒนาเว็บ วิศวกรรมซอฟต์แวร์ และมีส่วนร่วมในโปรเจกต์โอเพ่นซอร์สของชั้นเรียน"
    }
  }
}
